cask "visual-studio-code"
cask "homebrew/cask-versions/visual-studio-code-insiders"
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "iterm2-nightly"
cask "spotify"
cask "docker"
cask "ngrok"
cask "notion"
cask "postman"
cask "hyper"
cask "vagrant"
cask "kap" # screen capture
cask "rocket" # emoji quick picker
cask "vanilla" # hide mac menu bar
cask "alfred" # general purpose productivity
cask "hammerspoon" # OSX lua automation
cask "font-source-code-pro"
cask "font-hack"
cask "screenflow"
cask "skitch"
cask "mongodb"
cask "evernote"
cask "dash"

tap "homebrew/cask-fonts"
cask "font-fira-code"

tap "nektos/tap"
brew "nektos/tap/act"

brew "tree"
brew "mongodb"
brew "emacs-plus"
brew "git"
brew "gnupg"
brew "nvm"
brew "pinentry-mac"
brew "go"
brew "jsonnet"
brew "dep"
brew "hugo"
brew "python3"
brew "mtr"
brew "openssh"
brew "screenfetch"
brew "bash"
brew "zsh"
brew "pt"
brew "rg"
brew "fzf"
brew "yarn"
brew "ccat"
brew "rename" # util for batch renaming files
brew "pandoc"
brew "jq"
brew "awscli"
brew "aws-iam-authenticator"
brew "kubectl"
brew "terraform"
brew "nvm"
brew "httpie"
brew "nmap"

mas "Xcode", id: 497799835
mas "Day One", id: 1055511498
